Revit 2027 API
HermiteSpline.IsPeriodic Property
Returns whether the Hermite spline is periodic or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsPeriodic { get; }
Public ReadOnly Property IsPeriodic As Boolean
	Get
public:
property bool IsPeriodic {
	bool get ();
}
member IsPeriodic : bool with get
Property Value
Boolean
See Also
Reference
HermiteSpline Class
Autodesk.Revit.DB Namespace